# "coding:utf-8"
#
#***********************************************************************
#    Time           :2020年5月30日17:37:29
#    Author         :Kangruojin
#    Email          :mailbox_krj@163.com
#    Compile        :Python3.8
#    version        :1.1
#    Description    :循环和输入测试
#    FileName       :test_07_while_input
#***********************************************************************

#-----------------------------------------------------------------------
#测试标题打印函数
#-----------------------------------------------------------------------
global g_title_test_count
global g_title_str
g_title_test_count = 0
g_title_str = "--------------------------------------------------------"
def title_test(test_title_str):
	global g_title_test_count
	g_title_test_count += 1
	print("\n" + g_title_str)
	print(str(g_title_test_count) + "、" + test_title_str.lower() + ":")
	print(g_title_str)

#-----------------------------------------------------------------------
#input()、int()、float()等简单测试
#python2.7也支持input(),但是将用户输入当做python代码运行
#在python2.7中最好使用raw_input()来获取用户的信息输入而不是input()
#-----------------------------------------------------------------------
title_test("input() simple test")
while True:
	message = input("please enter your message:")
	if message == "quit":
		break;
	elif message == "":
		continue;
	print("your message is : " + message)
	print("your float number is : " + str(float(message)))
	print("your integer number is : " + str(int(message)))


#***********************************************************************
#input()结合字典和列表测试遍历、删除、添加操作
#***********************************************************************

#-----------------------------------------------------------------------
#数据初始化定义（正常为空，为了简单测试初始化了两本书）
#-----------------------------------------------------------------------
book_set  = {
	'新华书店':[
		{
			'检索号':'XH_1234567',
			'书名':'<<新华书店管理手册>>',
			'出版社':'新华出版社',
			'出版时间':'2020-05-30',
			'类别':'管理类',
			'定价':20.00,
			'作者':'佚名',
			'余量':100,
		},
		{
			'检索号':'XH_1234568',
			'书名':'<<三国演义>>',
			'出版社':'中华书局',
			'出版时间':'2010-03-10',
			'类别':'文学小说类',
			'定价':30.00,
			'作者':'罗贯中',
			'余量':10,
		},
	],
	
	'文轩新华书店':[],
	
	'钟楼书店':[],
	
	'1小时书屋':[],
	
	'伴清晨诗文':[],
	
	'考研辅导资料专卖':[],
	
	'博库书店':[],
}

#系统主菜单
select_menu_sys = {
	'0': "系统菜单",
	'1': "书籍遍历",
	'2': "书籍入库",
	'3': "借用书籍",
	'4': "书籍检索",
	'5': "书籍分类",
	'6': "退出图书管理系统",
}

#书店列表
book_store = [
	'新华书店',
	'文轩新华书店',
	'钟楼书店',
	'1小时书屋',
	'伴清晨诗文',
	'考研辅导资料专卖',
	'博库书店',
]

#书本属性列表
book_attr = [
	'检索号',
	'书名',
	'出版社',
	'出版时间',
	'类别',
	'定价',
	'作者',
	'余量',
]

#-----------------------------------------------------------------------
#功能函数：系统总菜单
#-----------------------------------------------------------------------
def book_menu_sys():
	print("--------------------------------------------------------")
	for choose in select_menu_sys.keys():
		print("\t" + str(choose) + " : " + str(select_menu_sys[choose]))
	print("--------------------------------------------------------")

#-----------------------------------------------------------------------
#功能函数：遍历指定书店的所有书并显示
#-----------------------------------------------------------------------
def book_traversal_store(book_store_lib):
	for index in range(0,len(book_store_lib)):
		for book_attr_name in book_attr:
			if book_attr_name in book_store_lib[index].keys():
				print("\t" + book_attr_name + " : " 
					+ str(book_store_lib[index][book_attr_name]))
		print("-------------------------------------")
		
#-----------------------------------------------------------------------
#功能函数：书店书籍遍历，系统总入口
#-----------------------------------------------------------------------
def book_traversal_sys():
	print("-------------------------------------")
	for book_store_name in book_store:
		if book_store_name in book_set.keys():
			book_store_lib = book_set[book_store_name]
			print(book_store_name + ":")
			print("-------------------------------------")
			book_traversal_store(book_store_lib)
	print("-------------------------------------")

#-----------------------------------------------------------------------
#功能函数：书店书籍添加入库，系统总入口
#-----------------------------------------------------------------------
def book_add_sys():
	print("-------------------------------------")
	print("书籍入库：")
	print("-------------------------------------")
	
#-----------------------------------------------------------------------
#功能函数：书店书籍借用，系统总入口
#-----------------------------------------------------------------------
def book_borrow_sys():
	print("-------------------------------------")
	print("书籍借用：")
	print("-------------------------------------")
	
#-----------------------------------------------------------------------
#功能函数：书店书籍索引，系统总入口
#-----------------------------------------------------------------------
def book_find_sys():
	print("-------------------------------------")
	print("书籍搜索：")
	print("-------------------------------------")
	
#-----------------------------------------------------------------------
#功能函数：书店书籍添分类，系统总入口
#-----------------------------------------------------------------------
def book_class_sys():
	print("-------------------------------------")
	print("书籍分类：")
	print("-------------------------------------")
	
#-----------------------------------------------------------------------
#功能函数：退出书店，系统总入口
#-----------------------------------------------------------------------
def book_quit_sys():
	print("-------------------------------------")
	print("退出!")
	print("-------------------------------------")

#-----------------------------------------------------------------------
#主菜单入口，系统菜单处理逻辑
#-----------------------------------------------------------------------
title_test("欢迎进入全国书籍检索网")

book_menu_sys()
menu_choose = True
while menu_choose:
	choose = input("请输入你要选择的操作(1~5):")
	print("-------------------------------------")
	if choose == "":
		continue
	elif choose not in select_menu_sys.keys():
		print("无效的输入，请在有效范围内输入操作编号！")
		
		continue
	#choose有效
	print("choose is " + str(choose) + ": " + str(select_menu_sys[choose]))
	
	if select_menu_sys[choose] == "系统菜单":
		book_menu_sys()
	elif select_menu_sys[choose] == "书籍遍历":
		book_traversal_sys()
	elif select_menu_sys[choose] == "书籍入库":
		book_add_sys()
	elif select_menu_sys[choose] == "借用书籍":
		book_borrow_sys()
	elif select_menu_sys[choose] == "书籍分类":
		book_class_sys()
	elif select_menu_sys[choose] == "退出图书管理系统":
		book_quit_sys()
		menu_choose = False
